const shopids = [
  191096305, // adidas
  79684414, // gap
  37004578, // L'Oréal Paris巴黎萊雅
  76650281, // DR.WU官方旗艦店
  364159, // KIMIS零食泡麵美妝台灣快速出貨
  5321159, // 艾比百貨 Abby生活百貨
  68758442, // ASUS華碩旗艦店
  4862389, // DaPoLuLuMi@露營中毒本鋪--蝦皮旗艦店
  24726251, // Vitos Lifestyle 飛拓思
  292252839, // Lululemon 瑜伽健身 高品質高質量版原廠店
  17133621, // BLADEZ X BH 官方旗艦店
  253406451, // KANGOL官方授權旗艦店 - PPBOX
  107927509, // anello 官方旗艦店
];

const shoes = [
  515690455, //MISS 21 品牌官方概念LAB
  266321798, // ALDO Shoes Taiwan
  372845744, // LA NEW 官方旗艦店
  17688167, // A.S.O阿瘦皮鞋 官方旗艦館
  7760174, // 鞋全家福購物網
  464393729, // 喬治皮鞋 GEORGE SHOES
  285428214, // Red Wing Heritage台灣官方旗艦店
  37317329, // Palladium 官方旗艦商城
  50812728, // Crocs官方直營店
  161856113, // 勃肯經銷 BIRKENSTOCK_台北饒河店
  56071487, // PONY 官方旗艦店
  24117335, // PLAYBOY.Disney
  53904988, // Keds台灣官方旗艦店
  77352272, // 勃肯BIRKENSTOCK  台灣南區經銷  不打布妻
  39003847, // native shoes旗艦店
  90178612, // Paidal官方旗艦店
  39387656, // FAIR LADY 專櫃女鞋官方旗艦店
  280904923, // Ea專櫃女鞋
  88058255, // Cumar Shoes 官方旗艦館
  25726131, // 富發牌
  8003233, // FM shoes
  9653727, // Ann'S 女鞋官方旗艦店
  292131299 //amai官方旗艦店
]

const exeshop = [
  31971171, //ON官方旗艦店
  437509074, //Reebok官方旗艦館
  6232547, //AquaFeb 運動商城
  453283526, //迪卡儂官方
  107082273, //TwinBrothers
  50364059, //A PLUS 品牌旗艦館
  70854705, //Sport City 流行時尚館
  16583247, //致一體育CHIH YI SPORTS
  104567297, // 輝葉運動旗艦館
  31978085, // MARS戰神官方旗艦店
  16616004, // 宙斯健身官方旗艦店
  226479203, // TeamJoined 健身裝備
  19728254, //SAN SPORTS
  53489782, //BEFIT 星品牌【官方旗艦店】
  68986121, //WELLCOME好吉康 官方直營旗艦店 | HEAD Fitness 台灣總代理
]

const mclothes = [
  29626355, //【GIORDANO 佐丹奴】
  31680065, // plain-me select shop】蝦皮OUTLET
  135828246, //EDWIN 官方直營店
  563809586, //Dickies Taiwan 官方直營店
  38338457, // BIG TRAIN 官方旗艦店
  30849289, //Lee Jeans 牛仔褲
  136081302, // BLUE WAY官方旗艦店
  30451186, // STAYREAL官方直營
  20530354, // 三花棉業官方直營旗艦館.襪子.平口褲.男內褲.男背心.男內衣
  14210359, // QIAO 潮人服飾旗艦店
  188316073, // CHECK 2 CHECK
  26716889, //COLOR 
  502083903, // 遠東FET  官方直營旗艦店
  84491807, // XLARGE 官方旗艦店
  182540850, // BEN DAVIS品牌旗艦店
  481727718, // American Eagle Official Store
  473129415, // BOSSINI堡獅龍官方旗艦店
  130156009, // Calvin Klein官方旗艦店
  81363889, // gildan_taiwan
]

const fClothes = [
  79684414, // Gap官方旗艦店
  43269385, // Levi's官方旗艦店
  574313480, // 黛安芬官方旗艦店
  421846559, // ROXY QUIKSILVER 官方直營店
  93465264, // 曼黛瑪璉品牌旗艦館
  36081008, // QUEENSHOP
  49101117, // U&Z官方直營
  125995979, // AIR SPACE
  78316491, // Lady內衣官方旗艦店
  37978953, // earth music&ecology Select Store
  226533901, // 6ixty8ight
  20601737, // caco_tw
  572526427, // sloggi 官方旗艦店
  105268937, // URBAN RESEARCH 官方直營店
  242824870, // Chantelle Lingerie仙黛爾集團官方旗艦店
  295735455, // MOSS CLUB官方直營店聯名品牌
  446090097, // LOVITO OFFICIAL STORE
  71911381, //BOBSON官方旗艦店
  272757918, //BRAPPERS 品牌旗艦店
  31186258, //【OB嚴選】品牌旗艦店
  400031701, // non-stop 官方旗艦店
  161461216, // COVERNAT_official
  375936957, // MO-BO
]

const outsideShpp = [
  410135909, // The North Face 官方旗艦店
  3782790, // 悠遊戶外-Camp Plus 天幕露營精品專門店
  37151393, //《Bogazy輕旅行》
  178207524, // GO WILD 野聚戶外
  17075634, // 台北山水戶外休閒用品專門店
  105016403, // Samsonite 新秀麗官方旗艦店
  1467161, // 獵漁人釣具
  110842125, // TEVA官方商城 台灣總代理
  75613795, // 悠遊山水戶外生活館旗艦店
  38627759, // 努特戶外用品
  5595711, // Deseno笛森諾旅行箱旗艦館
  28281555, // UV100專業機能防曬服飾
  35724391, // 趣嘢電動自行車總代理
  120292472, // HILL TOP 山頂鳥 官方旗艦館
  233346383, // 歐都納 ATUNAS
  267479790, // adidas官方旗艦館
  165707600, // SKECHERS官方旗艦店
  242587150, // FILA官方直營店
  115339732, // CONVERSE 旗艦店
  106973794, // ACS 跨運動 運動品牌專賣
  155980235, // 安德瑪Under Armour官方旗艦店
  261144688, // GARMIN 官方旗艦館
  131441298, // New Balance 官方旗艦店
]

const accessories = [
  30835502, // 點睛品 Chow Sang Sang Group
  301644797, // Daniel Wellington 官方直營
  142427276, //今生金飾 GoldenLife
  2275989, // CITIZEN星辰錶旗艦館
  225061298, // JustGold 鎮金店
  3299541, // 飾品控 SPANCONNY ACCESSORY
  69558607, // J'code 真愛密碼
  282640377, // JINS 台灣官方旗艦店
  102074088, // 2sweet甜蜜約定官方旗艦店
  51935472, // L ERICKSON 官方商店
  6982233, // 迎鶴金品
  22383, // AHUA 韓國襪子品牌旗艦店
  29588253, // ROYAL DAMON 羅亞戴蒙
  9498768, // LOTIN 羅婷 —唯一指定聯名、授權商品
  257422390, // 冉冉 ZANZAN
  9883615, // WINHUA JADE 文華珠寶翡翠專賣店
  75287863, // Lucy's 飾品
  35173775, // Vacanza Accessory 假期飾品官方旗艦店
  253438806, // 法蝶珠寶Papillon Jewelry
  28253070, // City Diamond引雅鑽石珠寶
  2035199, // Bonny&Read 飾品 - 官方商店
  112710883, // STORY ACCESSORY 官方旗艦店
  34398739, // Snatch Store
]

const cosmetics = [
  28944793, // 屈臣氏Watsons
  37004578, // 巴黎萊雅官方旗艦店
  56678703, //理膚寶水 官方旗艦店
  33206500, //康是美Cosmed
  26209760, // Neogence霓淨思官方旗艦店
  76650281, // DR.WU官方旗艦店
  37008598, // 媚比琳官方旗艦店
  11527054, // 小三美日
  585767396, //Sulwhasoo 雪花秀 官方旗艦店
  121821315, // LANEIGE 蘭芝 官方旗艦店
  319622244, // 台灣拜耳品牌旗艦館
  219820297, // 白蘭氏健康mall官方直營店
  121782721, // innisfree 官方旗艦店
  95818044, // 善存|挺立|克補 官方旗艦店
  70001183, // CeraVe官方旗艦店
  30225933, // Bio essence 碧歐斯
  121790231, //ETUDE HOUSE 官方旗艦店
  4215964, //Dr.Douxi朵璽官方旗艦館
  95086526, // 月星球 Dalnarashop
  108176175, // too cool for school 官方旗艦店
  31202234, // THE BODY SHOP官方旗艦店
  39126014, // 嬌生美妝生活達人館
  8526457 //HH草本新淨界-私密保養專家 
]

const baby = [
  12680234, //麗貝樂品牌旗艦店
  12480951, //P&G寶僑旗艦店
  76312747, //大樹健康購物網(大樹藥局線上)
  36633869, // 嬌聯官方旗艦店
  28706163, // 奈森克林官方旗艦館
  13039257, // chicco官方直營-義大利嬰幼館
  93110020, // Fées 法緻官方旗艦店
  12123891, //YODEE 優迪嚴選
  84552938, // 愛兒房 Baby House [官方商城]
  21507356, // 好娃娃親子生活館 【全館優惠中 | 99免運 】
  45244156, // Alobaby 100%日本製造原裝進口
  381693814, // 東雨文化TONY
  17387603, // 慕之恬廊官方旗艦店／0817-18滿299免運中
  41417984, // 玩具反斗城
  12665336, //Simba小獅王辛巴 官方旗艦店
  44206770, // Malldj親子購物網
  16634443, //PUKU藍色企鵝
  138772432, // 酷咕鴨 KUKU  Duckbill
  83259094, // 喬依思嬰童傢俱
  39126014, // 嬌生美妝生活達人館
  12496274, // MOTHER-K總代理】韓國婦幼品牌
  37125934, // Mamaway 媽媽餵 母嬰品牌領導者
]

const fbag = [
  189514107, //蝦皮輕奢時尚館
  69668202, //PLAYBOY包包 官方旗艦館
  362924534, //天藍小舖 SkyBlue
  18401262, //1/2princess
  39356469, //Kipling 官方旗艦店
  64788580, // 早苗帆布・手作 SANAE
  258475665, // DOUGHNUT | 台灣官方商城
  107927509, // anello 官方旗艦店
  73078818, // Grace gift 正式官方旗艦店
  497971222, // S'AIME 東京企劃官方旗艦店
  2175202, // COVERME
  2749661, // Bliss BKK
  93931387, // BAG TO YOU 百達遊
  139035394, // Arnold Palmer 包包皮件官方旗艦館
  51526610, // RITE 官方旗艦店
  54463739, // Kiiwi O!
  120563043, // Fennec Taiwan
  18364919, // PG美人網官方唯一旗艦店
  315115, // HC STORE 後背包專賣店
  321616352, // satana｜MIT包包專賣店
  33403830, // uniarts 官方旗艦館
  70783727, //kinazbag
]

const mbag = [
  76473497, //Braun Buffel德國小金牛&LOODER羅德官方旗艦店
  287567569, //SWATCH 官方旗艦店
  12368345, //ZIPPO官方旗艦店
  829685, //matchwood
  240191696, //Topologie 台灣官方旗艦店
  62050379, //Casio 卡西歐時計
  50207407, //WRITEK  利拓精品
  35354897, // NIID
  4172364, //Crocodile 鱷魚皮件官方旗艦店
  17920869, //74ounce
  1153580, //NIXON台灣總代理
  35356119, //EASTPAK官方旗艦店
  140967953, // JanSport Taiwan官方旗艦店
  1567680, // 除臭襪專家【FAV】現貨-滿額免運費-運動襪-台灣襪子需要您支持-
  50958996, // Bratpack風格戶外選品店
  57748698, //金安德森 品牌旗艦館
  212142358, //KENNETH COLE TIME 台灣官方旗艦館
  151392508, // TIMEX 天美時 品牌旗艦店
  8050829, // waken 威肯襪子專家
  25575842, // 英威塔 invicta 品牌旗艦店
  12449502, // CASIO卡西歐 宏崑時計
  6531002, // 足立康除臭襪Tree com專賣－最有效的不臭襪
]

const household = [
  9687994, //小麥購物
  14191115, //永豐商店官方旗艦店-五月花/得意/橘子工坊/柔情/植淨美/Frosch
  112813397, //特力家︱特力屋+HOLA
  3746101, //DESMOND岱思夢寢具
  5518372, //歐德萊生活工坊
  36578650, //倍潔雅/唯潔雅/優活─金盛世紙業(原廠直營)
  18561079, // 翔仔居家 SIANG.APATO
  77697116, // 3M 官方旗艦店
  71029966, // 法國特福
  1546550, // 凱堡家居生活館
  13942352, // LocknLock樂扣樂扣旗艦店
  9765477, // H&D東稻家居
  13690551, // 戀家小舖★網路寢具第一品牌
  4514571, //阿志小舖-日本進口生活館
  6911881, // 完美主義居家
  230404713, // WMF 官方旗艦館
  15991618, // 床寢時光 J-bedtime
  960481, // Norns
  8079288, // 【FL生活+】全館現貨販售
  5448870, // 機械堂KiKAiTO高效能專業電動工具
  29669479, // 花仙子官方商城
  270022711, // BRITA官方旗艦店
  9241878, // 舒潔/靠得住/好奇-金百利官方商城
]

const food = [
  22243507, // 臻御行 Zhen Yu House
  16927479, // 快車肉乾
  19788054, // 愛買線上購物
  3444013, // 正心堂花草茶（全健花茶）
  82067728, // 新東陽購物網【官方直營】
  15099073, // 亞尼克菓子工房
  26181450, // 每日優果食品
  54055210, // 哈根達斯官方旗艦店
  21003919, // 富統食品
  17386352, // 歐可茶葉 OK TEA
  4977062, // 老媽拌麵
  2083526, // 菓青市集 Green Market
  81599502, // 配菓配菓 PECOPECO ｜日本零食日本餅乾
  404357793, // 佐佐鮮 品牌館
  12537246, // Magi Planet星球工坊爆米花_官方商店
  15817197, // 菁豐商城
  39357417, // Teascovery 發現茶
  13749708, // 連珍糕餅
  34718854, // 網購水餃第一品牌-果貿吳媽家水餃
  43430653, // 鮮綠生活36life，生猛海鮮第一首選
  9188462, // 果紅美食kouka.food
  30849424, // 聯華食品旗艦店】原廠直送
  9046641, //米林香&黃正宜低卡餐 客製烘焙伴手禮 控醣控油生酮飲食
]

const car = [
  23151015, //YAMAHA 台灣山葉台益機車(YSP宏國)
  566715487, // SYM三陽 官方旗艦店
  180285057, // KYMCO 光陽機車 購物商城
  46437940, // 比帽王 騎士用品專賣店
  11171913, // Gozilla狗吉拉-Gogoro性能擴充改裝精品配件
  13546696, // Flyone|領先者(泓愷科技)
  82181713, // PX大通電子官方行車旗艦館
  16245560, // LOOKING 行車記錄器 官方直營
  10787030, // KT BIKER 派克車旅
  48815376, // 車麗屋汽車百貨股份有限公司
  225675009, // AUTOBACS日本 ‧ 安托華汽車百貨
  30775483, // 旭益購物網
  4208348, // 【Dr.ML駒典科技】汽機車配件專賣 五匹手機架台灣授權經銷商
  79554163, // WAXUP玩家級車蠟
  4329479, // K-WAX 汽車美容 汽車蠟 棕櫚蠟 鍍膜 維護劑 洗車藥水 洗車打蠟
  33638375, // PAPAGO品牌旗艦館
  62348923, // SONAX 歐洲第一汽車鍍膜 中性洗車藥劑 棕櫚蠟 洗車精 汽車美容 台灣總代理
  215441086, // SLO 速辰汽機車精品旗艦館
  296582321, // Mio 旗艦店 神達數位
  73423459, // ★新焦點麗車坊汽車百貨★
  49948456, //東杰貿易 汽車照明官方 汽車精品
  78391792, // Meguiars美光台灣總代理-美克拉
  38960211, // 鐵甲武士汽車百貨
]

const gameNcollection = [
  6104768, //必買站 bidbuy4utw
  152220123, // 美泰兒MATTEL 官方旗艦店
  139599945, // Hasbro孩之寶 官方旗艦店
  176496552, // KAKAO FRIENDS 官方旗艦店
  93955576, // 玩具e哥網路商城旗艦店
  285705541, // fun box 玩具旗艦館
  109638955, // Fubees
  495305228, // 命運好好玩
  25344177, // 吉祥開運坊
  173362974, // 99模玩｜模型專賣店
  229561243, // MUSE木棉花
  198815477, //迪傳播動漫館
  17774479, //野獸國
  474516482, //振光玩具兒童館
  236676071, //酷比樂玩具專賣店
  14814050, // e★hobby 萬年東海模型玩具專賣店
  502977985, // 夢天堂Toys｜全國最大動漫玩具模型專賣店
  1830034, // Jazzy_Taiwan.inc
  9303016, // JOYBUS玩具百貨
  139604946, //櫻桃小丸子官方正版授權商店
]

const pet = [
  7305672, // 力奇寵物網路商店
  5087546, // WANG寵物精品館
  4147419, // 酷狗寵物網
  131694831, // mao 高質感貓用品 - pidan 台灣代理
  29242527, // 狗族文化村
  8730825, // 萬倍富
  3347166, // Pet CEO．寵物執行長
  35695297, // SofyDOG蘇菲狗 旗艦店
  204071705, // Abao阿寶－全台首創寵物拌飯
  24400998, // 寵物夢工廠
  8969483, // 御品寵物商城
  53616232, // Wassup 挖砂貓砂
  1928431, // 柏詩科技有限公司三館
  48217916, // PCT好侶官方旗艦店
  159259313, // 希爾思授權嚴選館
  9444542, // 貓奴狗僕
  35588892, //臭味滾 直營店
  34901124, // 毛起來-官方旗艦店 (原 毛起來洗)
  80076343, // 木入森Moreson 官方旗艦店
  80142602, // Dr.Tim's 提姆博士-台灣總代理
  193573329, // 樂瑞森寵物生活品牌概念店
  63673720, // PAW&TAIL商城
  2482492, // 李小貓之家寵物概念生活館
]

const phone = [
  40469232, //SAMSUNG三星官方授權旗艦店
  15199365, // 小米官方旗艦店
  143543286, // realme官方旗艦店
  54598032, // 神腦生活 Senaonline
  98312571, // OPPO官方旗艦店
  37104997, //犀牛盾防摔手機殼 官方旗艦館
  482164692, // Google 產品官方授權旗艦店
  8255216, // ASUS官方授權通訊旗艦館
  60330807, // ONPRO 官方旗艦店
  102581974, // UAG台灣官方旗艦店
  250612844, // Soundcore 台灣旗艦店
  95739292, // vivo官方授權專賣店
  55660246, // HTC官方旗艦店
  62829559, // Mcdodo 台灣旗艦店
  67574794, // ANKER 旗艦館
  69986317, // SONY官方授權旗艦店
  6935945, // hoda官方賣場
  300903979, // SwitchEasy 美國魚骨 官方旗艦館
  262348728, // Amazfit華米官方旗艦館
  10398845, // Baseus倍思官方旗艦店
  29458946, // Moshi 官方旗艦店
  3979153, //DTAudio 旗艦商城
]

const pc = [
  54133273, //原價屋Coolpc
  116026822, // 順發3C SUNFAR
  68758442, // ASUS華碩旗艦店
  15228345, // Acer 宏碁官方授權經銷商
  64611424, // 富士品牌館
  219760837, // HP惠普品牌旗艦店
  116309859, // 蝦皮直送 3C家電
  233561043, // 德總3C 光華館
  48032592, // Logitech羅技官方旗艦館
  326230297, // MSI微星旗艦店|特約經銷
  261906682, //Microsoft 微軟品牌旗艦店
  55797099, // TP-Link官方旗艦店
  308060094, // Transcend創見官方旗艦店
  28288062, // Lenovo 聯想官方授權專賣店
  253518110, //SAMSUNG 三星儲存旗艦館
  57512093, // HyperX授權經銷店 友藝3C"
  40356424, // Future Lab. 未來實驗室【官方旗艦店】
  77690258, // SP廣穎電通 官方旗艦店
  17818745, //三井3C
  30296506, // 欣亞3c購物網
  62792009, // GoPro 台灣品牌店
  1422047, // Thermaltake曜越品牌旗艦店
  5001326, // 穩達3C電腦組裝
]

const appliance = [
  312985917, //全國電子旗艦店
  31171487, // 恆隆行戴森dyson專賣店
  81844674, //HITACHI日立生活家電館
  108078562, // LG旗艦館
  104788746, // Roborock 石頭科技官方旗艦店
  15199365, // 小米官方旗艦店
  100669896, // Philips 飛利浦旗艦館
  343219426, // TOSHIBA東芝旗鑑館
  57484544, // HERAN禾聯 熊好的店
  81867136, // SANLUX台灣三洋旗鑑館
  143159162, //ECOVACS 科沃斯 官方旗艦店
  58337056, // Coway 台灣官方商店
  82609442, // 東元家電生活館
  82417032, // SHARP夏普 官方旗艦店
  5453670, // 怡悅健康生活館
  36194558, // OSIM官方賣場
  56529655, // SPT精緻家電
  83898940, // SAMPO聲寶小家電旗艦館
  39275495, // 楊桃美食網
  36082578, // TESCOM 授權專賣店-羅森
  35593826, // Vitamix 旗艦館
  51492089, // 美國iRobot台灣獨家授權總經銷
]

const creative = [
  211208801, //eslite 誠品
  343962018, // Disney迪士尼文具旗艦店
  261260780, //方坊 Square Studio
  332741138, // 青青文具館
  184360498, // 不二馬大叔｜胡創商店
  213216210, // 久大文具連鎖
  83261873, //黃阿瑪的後宮生活_瑪瑪商行 (官方直營)
  8628220, // 賽先生科學工廠 Mr. Sci Science Factory
  217470736, // REDBOX IDEA
  159834670, // TAAZE讀冊生活網路書店
  16069207, // 變種吉娃娃官方商店
  162008941, // 馬克商學院
  15097354, // 柴犬大學 SHIBA UNIVERSITY
  569384790, // FNG 寶特 官方直營店
  20570968, //墊腳石購物網
  404511170, // 小日子 ONE LITTLE DAY
  53475757, // JINART"
  7157354, // Shock MAMA 蛋定人生
  147650089, // haoshi 良事設計
  105633, // Hi你好創意設計
  448617809, // Littdlework 品牌旗艦館
  34406835, // mr.sheep 官方旗艦店
  14692357, // 𝐔 𝐍 𝐈 𝐂 ®
]

export{
  shoes,
  exeshop,
  mclothes,
  fClothes,
  cosmetics,
  baby,
  fbag,
  mbag,
  accessories,
  household,
  food,
  car,
  gameNcollection,
  pet,
  phone,
  pc,
  appliance,
  creative
}